# language:ru
#@runnn
Функционал: Тестовый

  Сценарий: фреймворк
    * проверяется видимость элемента "Логотип"
    * поле "Поисковая строка" заполняется значением "фреймворк"
    * приостановка выполнения на "5" секунд
    * производится нажатие на элемент "Кнопка поиска"
    * загружается страница "Результат поиска"
    * загружается страница "Результат поиска"
    * проверяется видимость элемента "Сортировка результатов"
    * в коллекции "Результат поиска" присутствует "20" элементов


  Сценарий: java
    * приостановка выполнения на "5" секунд
    * поле "Поисковая строка" заполняется значением "java"
    * производится нажатие на элемент "Кнопка поиска"
    * загружается страница "Результат поиска"
    * приостановка выполнения на "5" секунд
    * в коллекции "Результат поиска" присутствует "20" элементов
    * приостановка выполнения на "5" секунд

  Сценарий: спонж
    * приостановка выполнения на "5" секунд
    * поле "Поисковая строка" заполняется значением "спонж"
    * приостановка выполнения на "5" секунд
    * производится нажатие на элемент "Кнопка поиска"
    * загружается страница "Результат поиска"
    * приостановка выполнения на "5" секунд
    * в коллекции "Результат поиска" присутствует "6" элементов

  Сценарий: матрёшка
    * поле "Поисковая строка" заполняется значением "матрёшка"
    * приостановка выполнения на "5" секунд
    * производится нажатие на элемент "Кнопка поиска"
    * загружается страница "Результат поиска"
    * в коллекции "Результат поиска" присутствует "20" элементов
    * приостановка выполнения на "5" секунд