# language:ru
#@runnn
Функционал: Тестовый

  Сценарий: фреймворки
    * поле "Поисковая строка" заполняется значением "фреймворки"
    * приостановка выполнения на "5" секунд
    * производится нажатие на элемент "Кнопка поиска"
    * загружается страница "Результат поиска"
    * приостановка выполнения на "5" секунд
    * в коллекции "Результат поиска" присутствует "20" элементов

  Сценарий: javaс
    * приостановка выполнения на "5" секунд
    * поле "Поисковая строка" заполняется значением "javaс"
    * производится нажатие на элемент "Кнопка поиска"
    * загружается страница "Результат поиска"
    * приостановка выполнения на "5" секунд
    * в коллекции "Результат поиска" присутствует "4" элементов
    * приостановка выполнения на "5" секунд

  Сценарий: поток
    * приостановка выполнения на "5" секунд
    * поле "Поисковая строка" заполняется значением "поток"
    * приостановка выполнения на "5" секунд
    * производится нажатие на элемент "Кнопка поиска"
    * загружается страница "Результат поиска"
    * приостановка выполнения на "5" секунд
    * в коллекции "Результат поиска" присутствует "20" элементов

  Сценарий: script
    * поле "Поисковая строка" заполняется значением "script"
    * приостановка выполнения на "5" секунд
    * производится нажатие на элемент "Кнопка поиска"
    * загружается страница "Результат поиска"
    * в коллекции "Результат поиска" присутствует "20" элементов
    * приостановка выполнения на "5" секунд