# language:ru
@runnn
Функционал: Тестовый

  Сценарий: яндекс
    * приостановка выполнения на "5" секунд
    * поле "Поисковая строка" заполняется значением "яндекс"
    * приостановка выполнения на "5" секунд
    * производится нажатие на элемент "Кнопка поиска"
    * загружается страница "Результат поиска"
    * в коллекции "Результат поиска" присутствует "20" элементов
    * приостановка выполнения на "5" секунд

  Сценарий: спонжик
    * поле "Поисковая строка" заполняется значением "спонжик"
    * поле "Поисковая строка" заполняется значением "спонжик"
    * поле "Поисковая строка" заполняется значением "спонжик"
    * поле "Поисковая строка" заполняется значением "спонжик"
    * поле "Поисковая строка" заполняется значением "спонжик"
    * приостановка выполнения на "5" секунд
    * производится нажатие на элемент "Кнопка поиска"
    * загружается страница "Результат поиска"
    * приостановка выполнения на "5" секунд
    * в коллекции "Результат поиска" присутствует "2" элементов
    * в коллекции "Результат поиска" выбирается элемент номер "2" и производится клик по фрагменту "Заголовок статьи"
    * загружается страница "Статья"
    * проверяется видимость элемента "Текст статьи"
    * производится нажатие на элемент "Бутерброд"
    * в коллекции "Меню бутерброда" производится клик по элементу с текстом "Администрирование"
    * на экране присутствует элемент с текстом "Странная география облачных сетей"
  Сценарий: тырдекс
    * приостановка выполнения на "5" секунд
    * поле "Поисковая строка" заполняется значением "тырдекс"
    * приостановка выполнения на "5" секунд
    * поле "Поисковая строка" заполняется значением "тырдекс"
    * приостановка выполнения на "5" секунд
    * поле "Поисковая строка" заполняется значением "тырдекс"
    * производится нажатие на элемент "Кнопка поиска"
    * загружается страница "Результат поиска"
    * приостановка выполнения на "5" секунд
    * в коллекции "Результат поиска" присутствует "0" элементов
    * приостановка выполнения на "5" секунд


  Сценарий: аплана
    * поле "Поисковая строка" заполняется значением "аплана"
    * производится нажатие на элемент "Кнопка поиска"
    * загружается страница "Результат поиска"
    * приостановка выполнения на "5" секунд
    * в коллекции "Результат поиска" присутствует "20" элементов
    * приостановка выполнения на "5" секунд